RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/middleware/sdmmc/mmc/fsl_mmc.c
            error = MMC_Read(card, dataAddrAlign ? nextBuffer : (uint8_t *)alignBuffer, (startBlock + blockDone),
                             FSL_SDMMC_DEFAULT_BLOCK_SIZE, blockCountOneTime);
            if (kStatus_Success != error)
            {
                error = kStatus_SDMMC_TransferFailed;
                break;
            }

            blockDone += blockCountOneTime;

            if (!card->noInteralAlign && (!dataAddrAlign))
            {
                (void)memcpy(nextBuffer, alignBuffer, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            }
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t MMC_WriteBlocks(mmc_card_t *card, const uint8_t *buffer, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);

    uint32_t blockCountOneTime;
    uint32_t blockLeft;
    uint32_t blockDone;
    const uint8_t *nextBuffer;
    bool dataAddrAlign   = true;
    uint8_t *alignBuffer = (uint8_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    status_t error       = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    blockLeft = blockCount;
    blockDone = 0U;

    error = MMC_CheckBlockRange(card, startBlock, blockCount);
    if (kStatus_Success != error)
    {
        error = kStatus_InvalidArgument;
    }
    else
    {
        while (blockLeft != 0U)
        {
            nextBuffer = (uint8_t *)((uint32_t)buffer + blockDone * FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            if (!card->noInteralAlign && (!dataAddrAlign || (0U != (((uint32_t)nextBuffer) & (sizeof(uint32_t) - 1U)))))
            {
                blockLeft--;
                blockCountOneTime = 1U;
                (void)memcpy(alignBuffer, nextBuffer, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
                dataAddrAlign = false;
            }
            else
            {
                if (blockLeft > card->host->maxBlockCount)
                {
                    blockLeft         = (blockLeft - card->host->maxBlockCount);
                    blockCountOneTime = card->host->maxBlockCount;
                }
                else
                {
                    blockCountOneTime = blockLeft;
                    blockLeft         = 0U;
                }
            }
            error = MMC_Write(card, dataAddrAlign ? nextBuffer : (uint8_t *)alignBuffer, (startBlock + blockDone),
                              FSL_SDMMC_DEFAULT_BLOCK_SIZE, blockCountOneTime);
            if (kStatus_Success != error)
            {
                error = kStatus_SDMMC_TransferFailed;
                break;
            }

            blockDone += blockCountOneTime;
            if (!card->noInteralAlign && (!dataAddrAlign))
            {
                (void)memset(alignBuffer, 0, FSL_SDMMC_DEFAULT_BLOCK_SIZE);
            }
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t MMC_EnableCacheControl(mmc_card_t *card, bool enable)
{
    assert(card != NULL);

    uint8_t cacheCtrl = 0;

    mmc_extended_csd_config_t extendedCsdconfig;

    /* check the target driver strength support or not */
    if (card->extendedCsd.cacheSize == 0U)
    {
        SDMMC_LOG("The cache is not supported by the mmc device\r\n");
        return kStatus_SDMMC_NotSupportYet;
    }

    if (enable)
    {
        cacheCtrl = MMC_CACHE_CONTROL_ENABLE;
    }

    /* Switch to high speed timing. */
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexCacheControl;
    extendedCsdconfig.ByteValue  = cacheCtrl;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
    {
        SDMMC_LOG("cache enabled failed\r\n");
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    card->extendedCsd.cacheCtrl = cacheCtrl;

    return kStatus_Success;
}

status_t MMC_FlushCache(mmc_card_t *card)
{
    assert(card != NULL);

    mmc_extended_csd_config_t extendedCsdconfig;
    status_t error = kStatus_Success;

    /* check the target driver strength support or not */
    if ((card->extendedCsd.cacheSize == 0U) || (card->extendedCsd.cacheCtrl != MMC_CACHE_CONTROL_ENABLE))
    {
        SDMMC_LOG("The cache is not supported or not enabled, please check\r\n");
        error = kStatus_SDMMC_NotSupportYet;
    }
    else
    {
        /* Switch to high speed timing. */
        extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
        extendedCsdconfig.ByteIndex  = (uint8_t)kMMC_ExtendedCsdIndexFlushCache;
        extendedCsdconfig.ByteValue  = MMC_CACHE_TRIGGER_FLUSH;
        extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
        if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig, 0U))
        {
            SDMMC_LOG("cache flush failed\r\n");
            error = kStatus_SDMMC_ConfigureExtendedCsdFailed;
        }
    }

    return error;
}

status_t MMC_SetSleepAwake(mmc_card_t *card, mmc_sleep_awake_t state)
{
    assert(card != NULL);
    status_t error = kStatus_Success;

    sdmmchost_cmd_t command      = {0};
    sdmmchost_transfer_t content = {0};

    if (card->extendedCsd.extendecCsdVersion <=
        (uint32_t)kMMC_ExtendedCsdRevision13) /* V4.3 or above version card support boot mode */
    {
        return kStatus_SDMMC_NotSupportYet;
    }

    error = MMC_PollingCardStatusBusy(card, false, MMC_CARD_ACCESS_WAIT_IDLE_TIMEOUT);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    /* deselect the card before enter into sleep state */
    if (state == kMMC_Sleep)
    {
        if (MMC_SelectCard(card, false) != kStatus_Success)
        {
            return kStatus_SDMMC_DeselectCardFailed;
        }
    }

    command.index        = (uint32_t)kMMC_SleepAwake;
    command.argument     = ((uint32_t)state << 15U) | (card->relativeAddress << 16U);
    command.responseType = kCARD_ResponseTypeR1b;

    content.command = &command;
    content.data    = NULL;

    error = MMC_Transfer(card, &content, 0U);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    /* Sleep awake timeout value 100ns * 2^sleepAwakeTimeout */
    error = MMC_PollingCardStatusBusy(card, false, (1UL << card->extendedCsd.sleepAwakeTimeout) / 10000U);
    if (kStatus_SDMMC_CardStatusIdle != error)
    {
        return kStatus_SDMMC_PollingCardIdleFailed;
    }

    /* select the card after wake up */
    if (state == kMMC_Awake)
    {
        if (MMC_SelectCard(card, true) != kStatus_Success)
        {
            return kStatus_SDMMC_SelectCardFailed;
        }
    }

    return kStatus_Success;
}

static status_t MMC_Erase(mmc_card_t *card, uint32_t startGroupAddress, uint32_t endGroupAddress)
{
    sdmmchost_cmd_t command      = {0};
    sdmmchost_transfer_t content = {0};
    status_t error               = kStatus_Success;

    /* Set the start erase group address */
    command.index              = (uint32_t)kMMC_EraseGroupStart;
    command.argument           = startGroupAddress;
    command.responseType       = kCARD_ResponseTypeR1;
    command.responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG;

    content.command = &command;
    content.data    = NULL;
    error           = MMC_Transfer(card, &content, 0U);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

